In [57]:
import pandas as pd
import numpy as np

In [58]:
df = pd.read_csv('data1.csv')

In [59]:
df

    NIK  C1  C2  C3  C4  C5  C6
0  1239  80  70  60  80  70  90
1  1010  90  70  80  60  80  70
2  1011  80  70  60  80  90  60

In [60]:
df2 = df[['C1', 'C2', 'C3', 'C4', 'C5', 'C6']]
df2.head()

   C1  C2  C3  C4  C5  C6
0  80  70  60  80  70  90
1  90  70  80  60  80  70
2  80  70  60  80  90  60

In [61]:
np_max = df2.max(axis=0)
np_max.head()

C1    90
C2    70
C3    80
C4    80
C5    90
dtype: int64

In [62]:
df3 = df2 / np_max
df3.head()

         C1   C2    C3    C4        C5        C6
0  0.888889  1.0  0.75  1.00  0.777778  1.000000
1  1.000000  1.0  1.00  0.75  0.888889  0.777778
2  0.888889  1.0  0.75  1.00  1.000000  0.666667

In [63]:
df3.round(2)

     C1   C2    C3    C4    C5    C6
0  0.89  1.0  0.75  1.00  0.78  1.00
1  1.00  1.0  1.00  0.75  0.89  0.78
2  0.89  1.0  0.75  1.00  1.00  0.67

In [64]:
wx = np.array([15, 15, 16, 19, 18, 17])

In [67]:
df4 = df3 * wx
df4.round(2)

      C1    C2    C3     C4    C5     C6
0  13.33  15.0  12.0  19.00  14.0  17.00
1  15.00  15.0  16.0  14.25  16.0  13.22
2  13.33  15.0  12.0  19.00  18.0  11.33

In [66]:
df4['TOTAL'] = df4.sum(axis=1)
df4.round(2)

      C1    C2    C3     C4    C5     C6  TOTAL
0  13.33  15.0  12.0  19.00  14.0  17.00  90.33
1  15.00  15.0  16.0  14.25  16.0  13.22  89.47
2  13.33  15.0  12.0  19.00  18.0  11.33  88.67